ART-Badge/SDK/libraries/inc/peripheral/rtl876x_lpc.h
#define IS_LPC_CONFIG_INT(INT) (((INT) == LPC_INT_LPCOMP_AON) || \
                                ((INT) == LPC_INT_LPCOMP_NV) || \
                                ((INT) == LPC_INT_LPCOMP_CNT))
#define IS_LPC_STATUS_INT(INT) (((INT) == LPC_INT_LPCOMP_AON) || \
                                ((INT) == LPC_INT_LPCOMP_CNT))
#define IS_LPC_CLEAR_INT(INT) ((INT) == LPC_INT_LPCOMP_CNT)

/** \defgroup   LPC_Flags_Definition    LPC Interrupts Definition
 * \{
 * \ingroup     LPC_Exported_constants
 */
#define LPC_FLAG_LPCOMP_AON                 (LPC_INT_LPCOMP_AON_EN_Msk)
#define LPC_FLAG_LPCOMP_CNT                 (LPC_INT_LPCOMP_CNT_EN_Msk)
/** \} */

#define IS_LPC_FLAG(FLAG) (((FLAG) == LPC_FLAG_LPCOMP_AON) || \
                           ((FLAG) == LPC_FLAG_LPCOMP_CNT))
#define IS_LPC_CLEAR_FLAG(FLAG) ((FLAG) == LPC_INT_LPCOMP_CNT)

/*============================================================================*
 *                         Functions
 *============================================================================*/

/**
 * \defgroup    LPC_Exported_Functions  Peripheral APIs
 * \{
 * \ingroup     LPC
 */

/**
 * \brief   Initializes LPC peripheral according to
 *          the specified parameters in LPC_InitStruct.
 * \param[in] LPC_InitStruct: Pointer to a LPC_InitTypeDef structure that contains
 *                            the configuration information for the specified LPC peripheral.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_lpc_init(void)
 * {
 *     LPC_InitTypeDef LPC_InitStruct;
 *
 *     LPC_StructInit(&LPC_InitStruct);
 *     LPC_InitStruct.LPC_Channel   = LPC_CAPTURE_CHANNEL;
 *     LPC_InitStruct.LPC_Edge      = LPC_VOLTAGE_DETECT_EDGE;
 *     LPC_InitStruct.LPC_Threshold = LPC_VOLTAGE_DETECT_THRESHOLD;
 *     LPC_Init(&LPC_InitStruct);
 *     LPC_Cmd(ENABLE);
 *
 *     LPC_ResetCounter();
 *     LPC_SetCompValue(LPC_COMP_VALUE);
 *     LPC_CounterCmd(ENABLE);
 *     LPC_INTConfig(LPC_INT_LPCOMP_CNT, ENABLE);
 *
 *     NVIC_InitTypeDef NVIC_InitStruct;
 *     NVIC_InitStruct.NVIC_IRQChannel = RTC_IRQn;
 *     NVIC_InitStruct.NVIC_IRQChannelPriority = 2;
 *     NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
 *     NVIC_Init(&NVIC_InitStruct);

 *     RTC_NvCmd(ENABLE);
 * }
 * \endcode
 */
void LPC_Init(LPC_InitTypeDef *LPC_InitStruct);

/**
 * \brief  Fills each LPC_InitStruct member with its default value.
 * \param[in]  LPC_InitStruct : Pointer to a LPC_InitTypeDef structure which will be initialized.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_lpc_init(void)
 * {
 *     LPC_InitTypeDef LPC_InitStruct;
 *
 *     LPC_StructInit(&LPC_InitStruct);
 *     LPC_InitStruct.LPC_Channel   = LPC_CAPTURE_CHANNEL;
 *     LPC_InitStruct.LPC_Edge      = LPC_VOLTAGE_DETECT_EDGE;
 *     LPC_InitStruct.LPC_Threshold = LPC_VOLTAGE_DETECT_THRESHOLD;
 *     LPC_Init(&LPC_InitStruct);
 * }
 * \endcode
 */
void LPC_StructInit(LPC_InitTypeDef *LPC_InitStruct);

/**
 * \brief  Enables or disables LPC peripheral.
 * \param[in]  NewState: New state of LPC peripheral.
 *      This parameter can be: ENABLE or DISABLE.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_lpc_init(void)
 * {
 *     LPC_InitTypeDef LPC_InitStruct;
 *
 *     LPC_StructInit(&LPC_InitStruct);
 *     LPC_InitStruct.LPC_Channel   = LPC_CAPTURE_CHANNEL;
 *     LPC_InitStruct.LPC_Edge      = LPC_VOLTAGE_DETECT_EDGE;
 *     LPC_InitStruct.LPC_Threshold = LPC_VOLTAGE_DETECT_THRESHOLD;
 *     LPC_Init(&LPC_InitStruct);
 *     LPC_Cmd(ENABLE);
 * }
 * \endcode
 */
void LPC_Cmd(FunctionalState NewState);

/**
 * \brief   Start or stop the LPC counter.
 * \param[in] NewState: New state of the LPC counter.
 *     This parameter can be one of the following values:
 *     \arg ENABLE: Start LPCOMP counter.
 *     \arg DISABLE: Stop LPCOMP counter.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_lpc_init(void)
 * {
 *     LPC_InitTypeDef LPC_InitStruct;
 *
 *     LPC_StructInit(&LPC_InitStruct);
 *     LPC_InitStruct.LPC_Channel   = LPC_CAPTURE_CHANNEL;
 *     LPC_InitStruct.LPC_Edge      = LPC_VOLTAGE_DETECT_EDGE;
 *     LPC_InitStruct.LPC_Threshold = LPC_VOLTAGE_DETECT_THRESHOLD;
 *     LPC_Init(&LPC_InitStruct);
 *     LPC_Cmd(ENABLE);
 *
 *     LPC_ResetCounter();
 *     LPC_SetCompValue(LPC_COMP_VALUE);
 *     LPC_CounterCmd(ENABLE);
 * }
 * \endcode
 */
void LPC_CounterCmd(FunctionalState NewState);

/**
 * \brief  Enables or disables the specified LPC interrupts.
 * \param[in] LPC_INT: Specifies the LPC interrupt source to be enabled or disabled.
 *      This parameter can be one of the following values:
 *      \arg LPC_INT_VOLTAGE_COMP: Voltage detection interrupt source.If Vin<Vth, cause this interrupt.
 *      \arg LPC_INT_COUNT_COMP: Couter comparator interrupt source.
 * \param[in]  NewState: New state of the specified LPC interrupt.
 *      This parameter can be: ENABLE or DISABLE.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_lpc_init(void)
 * {
 *     LPC_InitTypeDef LPC_InitStruct;
 *
 *     LPC_StructInit(&LPC_InitStruct);
 *     LPC_InitStruct.LPC_Channel   = LPC_CAPTURE_CHANNEL;
 *     LPC_InitStruct.LPC_Edge      = LPC_VOLTAGE_DETECT_EDGE;
 *     LPC_InitStruct.LPC_Threshold = LPC_VOLTAGE_DETECT_THRESHOLD;
 *     LPC_Init(&LPC_InitStruct);
 *     LPC_Cmd(ENABLE);
 *
 *     LPC_ResetCounter();
 *     LPC_SetCompValue(LPC_COMP_VALUE);
 *     LPC_CounterCmd(ENABLE);
 *     LPC_INTConfig(LPC_INT_LPCOMP_CNT, ENABLE);
 *
 *     NVIC_InitTypeDef NVIC_InitStruct;
 *     NVIC_InitStruct.NVIC_IRQChannel = RTC_IRQn;
 *     NVIC_InitStruct.NVIC_IRQChannelPriority = 2;
 *     NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
 *     NVIC_Init(&NVIC_InitStruct);

 *     RTC_NvCmd(ENABLE);
 * }
 * \endcode
 */
void LPC_INTConfig(uint32_t LPC_INT, FunctionalState NewState);

/**
 * \brief  Configure LPCOMP counter's comparator value.
 * \param[in]  value: LPCOMP counter's comparator value which can be 0 to 0xfff.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_lpc_init(void)
 * {
 *     LPC_InitTypeDef LPC_InitStruct;
 *
 *     LPC_StructInit(&LPC_InitStruct);
 *     LPC_InitStruct.LPC_Channel   = LPC_CAPTURE_CHANNEL;
 *     LPC_InitStruct.LPC_Edge      = LPC_VOLTAGE_DETECT_EDGE;
 *     LPC_InitStruct.LPC_Threshold = LPC_VOLTAGE_DETECT_THRESHOLD;
 *     LPC_Init(&LPC_InitStruct);
 *     LPC_Cmd(ENABLE);
 *
 *     LPC_ResetCounter();
 *     LPC_SetCompValue(LPC_COMP_VALUE);
 *     LPC_CounterCmd(ENABLE);
 * }
 * \endcode
 */
void LPC_SetCompValue(uint32_t value);

/**
 * \brief   Reset the LPC counter.
 * \param   None.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_lpc_init(void)
 * {
 *     LPC_InitTypeDef LPC_InitStruct;
 *
 *     LPC_StructInit(&LPC_InitStruct);
 *     LPC_InitStruct.LPC_Channel   = LPC_CAPTURE_CHANNEL;
 *     LPC_InitStruct.LPC_Edge      = LPC_VOLTAGE_DETECT_EDGE;
 *     LPC_InitStruct.LPC_Threshold = LPC_VOLTAGE_DETECT_THRESHOLD;
 *     LPC_Init(&LPC_InitStruct);
 *     LPC_Cmd(ENABLE);
 *
 *     LPC_ResetCounter();
 *     LPC_SetCompValue(LPC_COMP_VALUE);
 *     LPC_CounterCmd(ENABLE);
 * }
 * \endcode
 */
void LPC_ResetCounter(void);

/**
 * \brief  Checks whether the specified LPC interrupt is set or not.
 * \param[in]  LPC_INT: specifies the LPC interrupt to check.
 *   This parameter can be one of the following values:
 *     \arg LPC_INT_COUNT_COMP: couter comparator interrupt.
 * \return  The new state of SPI_IT (SET or RESET).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * #define LPC_CAPTURE_PIN                 P2_4
 * #define LPC_CAPTURE_CHANNEL             LPC_CAPTURE_PIN - P2_0

