ART-Badge/SDK/libraries/inc/peripheral/rtl876x_lpc.h
 * #define LPC_VOLTAGE_DETECT_EDGE         LPC_Vin_Over_Vth;
 * #define LPC_VOLTAGE_DETECT_THRESHOLD    LPC_2400_mV;
 * #define LPC_COMP_VALUE                  0x0A//A LPC comparator interrupt occurs every ten times
 *
 * void board_lpc_init(void)
 * {
 *     Pad_Config(LPC_CAPTURE_PIN, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_DISABLE,
 *                PAD_OUT_HIGH);
 *     Pinmux_Config(LPC_CAPTURE_PIN, IDLE_MODE);
 * }
 *
 * void driver_lpc_init(void)
 * {
 *     LPC_InitTypeDef LPC_InitStruct;
 *
 *     LPC_StructInit(&LPC_InitStruct);
 *     LPC_InitStruct.LPC_Channel   = LPC_CAPTURE_CHANNEL;
 *     LPC_InitStruct.LPC_Edge      = LPC_VOLTAGE_DETECT_EDGE;
 *     LPC_InitStruct.LPC_Threshold = LPC_VOLTAGE_DETECT_THRESHOLD;
 *     LPC_Init(&LPC_InitStruct);
 *     LPC_Cmd(ENABLE);
 *
 *     LPC_ResetCounter();
 *     LPC_SetCompValue(LPC_COMP_VALUE);
 *     LPC_CounterCmd(ENABLE);
 *     LPC_INTConfig(LPC_INT_LPCOMP_CNT, ENABLE);
 *
 *     NVIC_InitTypeDef NVIC_InitStruct;
 *     NVIC_InitStruct.NVIC_IRQChannel = RTC_IRQn;
 *     NVIC_InitStruct.NVIC_IRQChannelPriority = 2;
 *     NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
 *     NVIC_Init(&NVIC_InitStruct);

 *     RTC_NvCmd(ENABLE);
 * }
 *
 * void lpc_demo(void)
 * {
 *     board_lpc_init();
 *     driver_lpc_init();
 * }
 *
 * void RTC_Handler(void)
 * {
 *     if (LPC_GetINTStatus(LPC_INT_LPCOMP_CNT) == SET)
 *     {
 *         LPC_SetCompValue(LPC_GetCounter() + LPC_COMP_VALUE);
 *         LPC_ClearINTPendingBit(LPC_INT_LPCOMP_CNT);
 *     }
 * }
 * \endcode
 */
ITStatus LPC_GetINTStatus(uint32_t LPC_INT);

/**
 * \brief   Clear the specified LPC interrupt pending bit.
 * \param[in] LPC_INT: specifies the LPC interrupt to clear.
 *      This parameter can be one of the following values:
 *      \arg LPC_INT_COUNT_COMP: Couter comparator interrupt.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void lpc_demo(void)
 * {
 *     LPC_ClearINTPendingBit(LPC_INT_COUNT_COMP);
 * }
 * \endcode
 */
void LPC_ClearINTPendingBit(uint32_t LPC_INT);

/**
 * \brief   Read LPCOMP comparator value.
 * \param   None.
 * \return  LPCOMP comparator value.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void lpc_demo(void)
 * {
 *     uint16_t value = LPC_GetCompValue();
 * }
 * \endcode
 */
__STATIC_INLINE uint16_t LPC_GetCompValue(void)
{
    return ((LPC->LPC_CMP) & 0xFFF);
}

/**
 * \brief   Read LPC counter value.
 * \return  LPCOMP counter value.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void lpc_demo(void)
 * {
 *     uint16_t counter = LPC_GetCounter();
 * }
 * \endcode
 */
__STATIC_INLINE uint16_t LPC_GetCounter(void)
{
    return ((LPC->LPC_CNT) & 0xFFF);
}

/** \} */ /* End of group LPC_Exported_Functions */

#ifdef __cplusplus
}
#endif

#endif /* _RTL876X_LPC_H_ */



/******************* (C) COPYRIGHT 2020 Realtek Semiconductor Corporation *****END OF FILE****/

